# 深さ優先探索での実装
from collections import deque

N = 10
M = 12
input_lake = [['w', '.', '.', '.', '.', '.', '.', '.', '.', 'w', 'w', '.'],
              ['.', 'w', 'w', 'w', '.', '.', '.', '.', '.', 'w', 'w', 'w'],
              ['.', '.', '.', '.', 'w', 'w', '.', '.', '.', 'w', 'w', '.'],
              ['.', '.', '.', '.', '.', '.', '.', '.', '.', 'w', 'w', '.'],
              ['.', '.', '.', '.', '.', '.', '.', '.', '.', 'w', '.', '.'],
              ['.', '.', 'w', '.', '.', '.', '.', '.', '.', 'w', '.', '.'],
              ['.', 'w', '.', 'w', '.', '.', '.', '.', '.', 'w', 'w', '.'],
              ['w', '.', 'w', '.', 'w', '.', '.', '.', '.', '.', 'w', '.'],
              ['.', 'w', '.', 'w', '.', '.', '.', '.', '.', '.', 'w', '.'],
              ['.', '.', 'w', '.', '.', '.', '.', '.', '.', '.', 'w', '.']]
# 番兵化する
lake = [[]] * N
for i in range(N):
    col = input_lake[i]
    col.insert(0, '.')
    col.append('.')
    lake[i] = col
lake.insert(0, ['.'] * (M+2))
lake.append(['.'] * (M+2))


cnt = 0
for i in range(1, N + 1):
    for j in range(1, M + 1):
        if lake[i][j] == 'w':
            lake[i][j] = '.'

            stack = deque([[i, j]])
            while stack:
                y, x = stack.pop() #　popleft()にすれば幅優先探索になる

                #8近傍
                directions = [[1, 0], [0, 1], [-1, 0], [0, -1], [-1, 1], [1, -1], [-1, -1], [1, 1]]

                for d in directions:
                    if lake[y + d[0]][x + d[1]] == 'w':
                        lake[y + d[0]][x + d[1]] = '.'
                        stack.append([y + d[0], x + d[1]])

            cnt += 1

print(cnt)
